Revit 2027 API
KeynoteEntry(String, String) Constructor
 Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public KeynoteEntry(
	string key,
	string text
)
Public Sub New (
	key As String,
	text As String
)
public:
KeynoteEntry(
	String^ key,
	String^ text
)
new :
        key : string *
        text : string -> KeynoteEntry
Parameters
key String
 The key of this KeynoteEntry
text String
 The text associated with this KeynoteEntry
Exceptions
Exception | Condition
ArgumentException |  key is an empty string.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
KeynoteEntry Class
KeynoteEntry Overload
Autodesk.Revit.DB Namespace